package Easy;

public class Questions {

    /*

    1. JDBC - это встроенный инструмент JDK, который позволяет работать с БД.
    JPA - это стандарт интерфейса и правил для удобной работы с БД.
    ORM - это технология, которая переводит код в sql-инструкции.
    Hibernate - одна из популярнейших реализаций JPA, для удобной работы с БД.
    JdbcTemplate — это класс из Spring, который упрощает работу с JDBC.
    CRUD-операции - это фундамент любого приложения, это запросы\методы\инструменты (операции),
    которые позволяют создавать (create), читать (read), обновлять (update) и удалять (delete) данные.

    2. Реализации JPA - Hibernate, EclipseLink, OpenJPA.

    3. Аннотация @Entity - помогает указать сущность для программы-реализатора JPA.

    4. Аннотация @Temporal используется только для полей типа java.util.Date и java.util.Calendar.
    Аннотацию Table@ можно не ставить над классом, если ты хочешь,
        чтобы таблица в БД была с таким же названием, как и класс в котором она реализуется.
    5. Связи между сущностями бывают - один к одному (1 человек - 1 паспорт),
        один ко многим (1 человек - много одежды), многие ко многим (много студентов - много курсов).

    6. Способы наследования сущностей - табличное наследование, классное наследование,
        наследование через маппинг и таблица для каждого класса с объединениями.

    7. Типы наследования сущностей - SINGLE_TABLE, JOINED, TABLE_PER_CLASS, MappedSuperclass.

    */

}